Revit 2027 API
VertexStreamPosition.AddVertex Method
 Inserts a VertexStreamPosition into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertex(
	VertexPosition vertex
)
Public Sub AddVertex (
	vertex As VertexPosition
)
public:
void AddVertex(
	VertexPosition^ vertex
)
member AddVertex :
        vertex : VertexPosition -> unit
Parameters
vertex VertexPosition
 The vertex to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace